; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v9 ?v4)
             (pred_3 ?v6 ?v2)
             (pred_5 ?v9 ?v2)
             (pred_11 ?v11 ?v9 )
	     (pred_7 ?v9)
             (pred_10 ?v13)
             (pred_2 ?v6)
             (pred_4 ?v2)
             (pred_9 ?v9)
             (pred_8 ?v6)
             (pred_1 ?v9)
             (pred_6 ))



(:action op_2
:parameters (?v3 ?v1 ?v12 ?v5)
:precondition (and (pred_10 ?v3) (pred_10 ?v1) (pred_2 ?v12) (pred_4 ?v5)
          (pred_12 ?v3 ?v1) (pred_3 ?v12 ?v5)
                   (pred_5 ?v1 ?v5) (pred_7 ?v3) 
                   (pred_9 ?v1) (pred_8 ?v12))
:effect (and  (pred_1 ?v1) (not (pred_9 ?v1))))


(:action op_5
:parameters (?v3 ?v7)
:precondition (and (pred_10 ?v3) (pred_10 ?v7)
               (pred_7 ?v3) (pred_12 ?v3 ?v7) (pred_1 ?v7))
:effect (and (pred_7 ?v7) (not (pred_7 ?v3))))

(:action op_4
:parameters (?v3 ?v12)
:precondition (and (pred_10 ?v3) (pred_2 ?v12) 
                  (pred_7 ?v3) (pred_11 ?v12 ?v3) (pred_6 ))
:effect (and (pred_8 ?v12)
   (not (pred_11 ?v12 ?v3)) (not (pred_6 ))))


(:action op_1
:parameters (?v3 ?v10 ?v8)
:precondition (and (pred_10 ?v3) (pred_2 ?v10) (pred_2 ?v8)
                  (pred_7 ?v3) (pred_8 ?v8) (pred_11 ?v10 ?v3))
:effect (and (pred_8 ?v10) (pred_11 ?v8 ?v3)
        (not (pred_8 ?v8)) (not (pred_11 ?v10 ?v3))))

(:action op_3
:parameters (?v3 ?v12)
:precondition (and (pred_10 ?v3) (pred_2 ?v12) 
                  (pred_7 ?v3) (pred_8 ?v12))
:effect (and (pred_6 ) (pred_11 ?v12 ?v3) (not (pred_8 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_07 obj_08 obj_19 obj_18 obj_13 obj_11 obj_01 obj_04 obj_15 obj_03 obj_09 obj_02 obj_17 obj_14 obj_16
    obj_05 obj_06
    obj_20 obj_12
    )

    (:init
       (pred_6)

       (pred_10 obj_10)
       (pred_10 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_19)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_15)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_02)
       (pred_10 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_16)
       (pred_4 obj_05)
       (pred_4 obj_06)
       (pred_2 obj_20)
       (pred_2 obj_12)

       (pred_12 obj_10 obj_18)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_08 obj_11)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_18 obj_04)
       (pred_12 obj_18 obj_13)
       (pred_12 obj_18 obj_10)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_13 obj_18)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_08)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_01 obj_09)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_04 obj_15)
       (pred_12 obj_04 obj_18)
       (pred_12 obj_15 obj_17)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_15 obj_04)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_03 obj_09)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_09 obj_16)
       (pred_12 obj_09 obj_01)
       (pred_12 obj_09 obj_03)
       (pred_12 obj_02 obj_17)
       (pred_12 obj_02 obj_04)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_15)
       (pred_12 obj_17 obj_02)
       (pred_12 obj_14 obj_16)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_16 obj_09)
       (pred_12 obj_16 obj_14)
       (pred_9 obj_10)
       (pred_9 obj_03)
       (pred_5  obj_10 obj_05)
       (pred_5  obj_03 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_08)
       (pred_1 obj_19)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_11)
       (pred_1 obj_01)
       (pred_1 obj_04)
       (pred_1 obj_15)
       (pred_1 obj_09)
       (pred_1 obj_02)
       (pred_1 obj_17)
       (pred_1 obj_14)
       (pred_1 obj_16)

       (pred_3  obj_20 obj_05)
       (pred_3  obj_12 obj_06)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_12 obj_11)
       (pred_7 obj_09)
    )

    (:goal (and
       (pred_11 obj_20 obj_17)
    ))
(:constraints
  (always (not (pred_7 obj_14)))
)
)

; plan
1. (op_4 obj_09 obj_20)
   deleted: (pred_11 obj_20 obj_09) (pred_6)
   added: (pred_8 obj_20)
   goals met: 0 of 1
2. (op_5 obj_09 obj_01)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_01)
   goals met: 0 of 1
3. (op_5 obj_01 obj_11)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_13)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_13)
   goals met: 0 of 1
5. (op_5 obj_13 obj_15)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_15)
   goals met: 0 of 1
6. (op_5 obj_15 obj_17)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_17)
   goals met: 0 of 1
7. (op_3 obj_17 obj_20)
   deleted: (pred_8 obj_20)
   added: (pred_6) (pred_11 obj_20 obj_17)
   goals met: 1 of 1
